import { BusinessIcon, PeopleIcon } from "./graphics";

export interface StaticData_i {
  title: string;
  Icon: React.FC<{ className: string }>;
  description: React.ReactNode[];
}

export const StaticData: StaticData_i[] = [
  {
    title: "Who?",
    Icon: PeopleIcon,
    description: [
      <>
        พวกเราคือ<b>กลุ่มเยาวชนไทย</b>
        ที่เล็งเห็นถึงความเป็นไปได้ในการต่อยอดเเละพัฒนาความสามารถ
        ของเยาวชนรุ่นใหม่ โดยเกิดจากการร่วมมือของนักเรียน นักศึกษา
        จากหลากหลายสถาบัน แต่
        <b>มีเป้าหมายเดียวกัน</b>คือการ<b>พัฒนาศักยภาพการทำงาน</b>
        อย่างไร้ขีดจํากัด เพื่อ<b>ขับเคลื่อนวงการละครเวทีไทย</b>
        เเละคงไว้ซึ่งคุณค่าสืบต่อไป
      </>,
    ],
  },
  {
    title: "What?",
    Icon: BusinessIcon,
    description: [
      <>
        พวกเรามีความตั้งใจที่จะส่งเสริมศักยภาพของเด็กไทย
        และขับเคลื่อนวงการละครเวทีไทยให้ก้าวหน้ายิ่งขึ้น ผ่านการสร้างโปรเจคเพื่อ
        <b>เปิดโอกาสให้เด็กไทยได้สะสมประสบการณ์การทำงานในสถานที่จริง</b>
        อีกทั้งยังอยากเป็นแรงบันดาลใจให้กับเด็กทุกคนที่มีความฝัน
        ให้กล้าที่จะลุกขึ้นมาทำสิ่งดี ๆ เพื่อตนเองเเละสังคม
        องค์กรของเรามีเป้าหมายที่จะทำการ<b>จัดการแสดงละครเวทีในทุกปี</b>{" "}
        โดยในแต่ละปี จะมีการ<b>เปิดรับสมัครนักเรียน-นักศึกษา</b> ในช่วงอายุ
        16-20 เพื่อเปิดโอกาสในการพัฒนาดังกล่าว
      </>,
    ],
  },
  {
    title: "Why?",
    Icon: BusinessIcon,
    description: [
      <>
        ในปัจจุบันละครเวทีในประเทศไทยยังไม่ได้เป็นที่นิยม
        เมื่อเทียบกับละครเวทีในต่างประเทศ เเต่ทว่า ก็ยังมีเด็กไทยจำนวนมากที่
        <b>มีความชอบและความสนใจในด้านนี้</b>
        เพียงเเต่ขาดโอกาสในการต่อยอดและพัฒนา พวกเราจึงมีความตั้งใจอย่างมากที่จะ
        <b>สร้างสถานที่ที่สามารถลงมือทําได้จริง</b>
      </>,
    ],
  },
];
